In [60]:
import pandas as pd
import numpy as np

In [61]:
student = {
    "Name": ["Ankit", "Ashwani","Akshansh", np.nan, "Krish", None, "NA"],
    "Section": ["CH", "CH", "MP", np.nan, "SS", np.nan, "Missing"],
    # "Registration_Id": [12018329, 12016043, 12015923, 12014917, 12018275, 12018433, 12015939],
    # "Registration_Id": ["12018329", "12016043", "12015923", "12014917", "12018275", "12018433", "12015939"],
    "City" : ['Fatehabad', "Bahadurgarh", "Gurgaon", None, "Jaipur", np.nan, 'NA'],
    "State" :[ None ,"Harayana", "Harayana", np.nan, "Rajasthan" ,'UP' ,"Missing"]}

In [62]:
df = pd.DataFrame(student)
df

       Name  Section         City      State
0     Ankit       CH    Fatehabad       None
1   Ashwani       CH  Bahadurgarh   Harayana
2  Akshansh       MP      Gurgaon   Harayana
3       NaN      NaN         None        NaN
4     Krish       SS       Jaipur  Rajasthan
5      None      NaN          NaN         UP
6        NA  Missing           NA    Missing

In [63]:
df.dropna()

       Name  Section         City      State
1   Ashwani       CH  Bahadurgarh   Harayana
2  Akshansh       MP      Gurgaon   Harayana
4     Krish       SS       Jaipur  Rajasthan
6        NA  Missing           NA    Missing

In [64]:
# Same values with default parameters produce the same result

df.dropna(axis='index', how = 'any')

       Name  Section         City      State
1   Ashwani       CH  Bahadurgarh   Harayana
2  Akshansh       MP      Gurgaon   Harayana
4     Krish       SS       Jaipur  Rajasthan
6        NA  Missing           NA    Missing

axis = index : drop rows if there contains na or missing values
axis = columns : drop columns if there contains na or missing values

how : criteria that is used to drop row or columns
any = drops every rows which contains atleast missing values(but that this might not be what you want, For eg, it might be ok if the user which have not entered information which is optional)

In [65]:
# it will drop rows which has every missing values
df.dropna(axis='index', how = 'all')

       Name  Section         City      State
0     Ankit       CH    Fatehabad       None
1   Ashwani       CH  Bahadurgarh   Harayana
2  Akshansh       MP      Gurgaon   Harayana
4     Krish       SS       Jaipur  Rajasthan
5      None      NaN          NaN         UP
6        NA  Missing           NA    Missing

In [66]:
#  applying on columns

df.dropna(axis='columns', how = 'any')

# it will return an empty dataframe since every columns contains atleast 1 missing value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

subset = ['email']
not dropping all the rows which have atleast their email address

In [67]:
df.dropna(axis='index', how = 'any', subset= ['City'])
#  same result will be for how = 'all' since we are checking for a single value only

       Name  Section         City      State
0     Ankit       CH    Fatehabad       None
1   Ashwani       CH  Bahadurgarh   Harayana
2  Akshansh       MP      Gurgaon   Harayana
4     Krish       SS       Jaipur  Rajasthan
6        NA  Missing           NA    Missing

In [68]:
df.dropna(axis='index', how = 'any', subset= ['City', 'Name'])

       Name  Section         City      State
0     Ankit       CH    Fatehabad       None
1   Ashwani       CH  Bahadurgarh   Harayana
2  Akshansh       MP      Gurgaon   Harayana
4     Krish       SS       Jaipur  Rajasthan
6        NA  Missing           NA    Missing

use inplace to permanently change

Now to handle the string values which are written as NA or Missing we will first replace all those stirng values to numpy nan datatype and then drop the values according to the requirement

In [69]:
df.replace('NA', np.nan, inplace= True)
df.replace('Missing', np.nan, inplace= True)

In [70]:
df

       Name Section         City      State
0     Ankit      CH    Fatehabad       None
1   Ashwani      CH  Bahadurgarh   Harayana
2  Akshansh      MP      Gurgaon   Harayana
3       NaN     NaN         None        NaN
4     Krish      SS       Jaipur  Rajasthan
5      None     NaN          NaN         UP
6       NaN     NaN          NaN        NaN

In [71]:
df.dropna()

       Name Section         City      State
1   Ashwani      CH  Bahadurgarh   Harayana
2  Akshansh      MP      Gurgaon   Harayana
4     Krish      SS       Jaipur  Rajasthan

If you wnat to see which of them is an na value we can use the isna value which will mask those values in terms of true or false

In [72]:
df.isna()

    Name  Section   City  State
0  False    False  False   True
1  False    False  False  False
2  False    False  False  False
3   True     True   True   True
4  False    False  False  False
5   True     True   True  False
6   True     True   True   True

suppose you want to assign grading to test of student and you find (every type of) NA in it this means that the student was not present during the test or whatsover. so u can change that value to 0 (or acc to dev wish) so that it becomes easy to perform operations on dataframe.

this is where we use fillna

In [74]:
# df.fillna('MISSING_VAL')
df.fillna(0)

       Name Section         City      State
0     Ankit      CH    Fatehabad          0
1   Ashwani      CH  Bahadurgarh   Harayana
2  Akshansh      MP      Gurgaon   Harayana
3         0       0            0          0
4     Krish      SS       Jaipur  Rajasthan
5         0       0            0         UP
6         0       0            0          0

Casting Datatypes

In [75]:
 df.dtypes

Name       object
Section    object
City       object
State      object
dtype: object

suppose there is a column name age now you know that those columns should only contain a single datatype i.e, integer. This is what we can see in the above scenario. This means it's a mixture of different datatypes. So if we wanted avg or other aggregrate function then it wouldn'y work

In [76]:
type(np.nan)

float

In [78]:
df['age'] = df['City'].astype(int)
# throws an error

ValueError: invalid literal for int() with base 10: 'Fatehabad'

So in whole when working with int values use the np.nan to convert na values to np.nan (float type) so that we can work with the numbers despite the presence of na values